app/controllers/articles_controller.rb

  def create
    puts "Creating article..."
    @article = Article.create(article_params)
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Test New Article"], ["body", "Test ner article link test new link."], ["created_at", "2016-03-09 02:01:56.986205"], ["updated_at", "2016-03-09 02:01:56.986205"]]